-- phpMyAdmin SQL Dump
-- version 5.2.1deb3
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:3306
-- Час створення: Січ 21 2025 р., 20:53
-- Версія сервера: 8.0.39-0ubuntu0.24.04.2
-- Версія PHP: 8.3.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База даних: `VNTU`
--

-- --------------------------------------------------------

--
-- Структура таблиці `assessmentCriterias`
--

CREATE TABLE `assessmentCriterias` (
  `id` int NOT NULL,
  `educationalDisciplineWPId` int DEFAULT NULL,
  `lessonTypeId` int DEFAULT NULL,
  `taskTypeId` int DEFAULT NULL,
  `isGeneral` tinyint(1) DEFAULT NULL,
  `A` text,
  `B` text,
  `C` text,
  `D` text,
  `E` text,
  `FX` text,
  `F` text,
  `FXAndF` text,
  `isAdditionalTask` tinyint(1) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп даних таблиці `assessmentCriterias`
--

INSERT INTO `assessmentCriterias` (`id`, `educationalDisciplineWPId`, `lessonTypeId`, `taskTypeId`, `isGeneral`, `A`, `B`, `C`, `D`, `E`, `FX`, `F`, `FXAndF`, `isAdditionalTask`) VALUES
(1, NULL, NULL, NULL, 1, 'Програмні результати досягнуті повністю. Теоретичний зміст курсу освоєний цілком, без прогалин; виявлено глибокі знання та розуміння предметної області та розуміння професійної діяльності, сформовано необхідні практичні навички вирішувати професійні завдання з організації реструктуризації та санації інноваційного підприємництва і розв’язувати проблеми у кризових ситуаціях з урахуванням зовнішніх та внутрішніх впливів; усі передбачені програмою навчання навчальні завдання виконані, якість їхнього виконання оцінено числом балів, близьким до максимального', 'Програмні результати досягнуті повністю. Теоретичний зміст курсу освоєний цілком, без прогалин; сформовано  уміння викладати основні ідеї щодо з організації реструктуризації та санації інноваційного підприємництва. Необхідні практичні навички роботи з освоєним матеріалом в основному сформовані, усі передбачені програмою навчання навчальні завдання виконані, якість виконання більшості з них оцінено числом балів, близьким до максимального', 'Програмні результати досягнуті повністю. Теоретичний зміст курсу освоєний цілком, без прогалин. Вміння викладати базові ідеї щодо з організації реструктуризації та санації інноваційного підприємництва,  а також практичні навички роботи з освоєним матеріалом сформовані недостатньо; усі передбачені програмою навчання завдання виконані, якість виконання жодного з них не оцінено мінімальним числом балів, деякі види завдань виконані з помилками', 'Програмні результати досягнуті. Теоретичний зміст курсу освоєний частково, але прогалини не носять істотного характеру, виявлено знання та розуміння основних положень реструктуризації та санації; необхідні практичні навички роботи з освоєним матеріалом в основному сформовані, більшість передбачених програмою навчання навчальних завдань виконано, деякі з виконаних завдань  містять помилки', 'Програмні результати досягнуті. Теоретичний зміст курсу освоєний частково, деякі практичні навички роботи не сформовані, частина передбачених програмою навчання завдань не виконано або якість виконання оцінено числом балів, близьким до мінімального', 'Програмні результати не досягнуті. Теоретичний зміст курсу освоєний частково, необхідні практичні навички роботи не сформовані, більшість передбачених програм навчання навчальних завдань не виконано, або якість їхнього виконання оцінено числом балів, близьким до мінімального; при додатковій самостійній роботі над матеріалом курсу можливе підвищення якості виконання навчальних завдань (з можливістю повторного складання)', 'Програмні результати не досягнуті. Теоретичний зміст курсу не освоєно, необхідні практичні навички роботи не сформовані, усі виконані навчальні завдання містять грубі помилки, додаткова самостійна робота над матеріалом курсу не приведе до якого-небудь значущого підвищення якості виконання навчальних завдань (з обов’язковим повторним курсом)', NULL, NULL),
(2, NULL, 2, NULL, NULL, 'Виставляється при правильному та безпомилковому проведенні необхідних розрахунків з поясненням і коментуванням отриманих результатів', 'При правильному і безпомилковому розв\'язанні завдання, але без пояснень до розрахунків, без посилань на певні формули чи методики, при відсутності або помилкових коментарях до отриманих результатів', 'При правильному розв\'язанні завдання, з деякими незначними помилками, без пояснень до розрахунків, без посилань на певні формули чи методики, при відсутності або помилкових коментарях до отриманих результатів', 'Виставляється, якщо при виконанні завдання допущені помилки, які свідчать про недостатнє знання теорії', 'Виставляється, якщо при виконанні завдання допущені помилки, які свідчать про недостатнє знання теорії, пояснення відсутні або фрагментарні', NULL, NULL, 'Виставляється у випадку, якщо завдання не виконане взагалі', NULL),
(3, NULL, 3, NULL, NULL, 'Виставляється при правильному та безпомилковому проведенні необхідних розрахунків з поясненням і коментуванням отриманих результатів', 'Виставляється при правильному і безпомилковому розв\'язанні завдання, але без пояснень до розрахунків, без посилань на певні формули чи методики, при відсутності або помилкових коментарях до отриманих результатів', 'Виставляється  при правильному розв\'язанні завдання, з деякими незначними помилками, без пояснень до розрахунків, без посилань на певні формули чи методики, при відсутності або помилкових коментарях до отриманих результатів', 'Виставляється, якщо при виконанні завдання допущені помилки, які свідчать про недостатнє знання теорії', 'Виставляється, якщо при виконанні завдання допущені помилки, які свідчать про недостатнє знання теорії, пояснення відсутні або фрагментарні.', NULL, NULL, 'Виставляється у випадку, якщо завдання не виконане взагалі', NULL),
(4, NULL, 4, NULL, NULL, 'Виставляється при правильному та безпомилковому виконанні поставлених завдань з поясненням і коментуванням отриманих результатів', 'Виставляється при правильному і безпомилковому виконанні завдання, але без пояснень до розрахунків, без посилань на певні формули чи методики, при відсутності або помилкових коментарях до отриманих результатів', 'Виставляється при правильному виконанні завдання, з деякими незначними помилками, без пояснень до розрахунків, без посилань на певні формули чи методики, при відсутності або помилкових коментарях до отриманих результатів', 'Виставляється, якщо при виконанні завдання допущені помилки, які свідчать про недостатнє знання теорії та практики виконання.', 'Виставляється, якщо при виконанні допущені помилки, які свідчать про недостатнє знання теорії та практики, пояснення відсутні або фрагментарні.', NULL, NULL, 'Виставляється у випадку, якщо завдання не виконане взагалі або виконана з великою кількістю помилок', NULL),
(5, NULL, NULL, 1, NULL, 'Повна відповідність змісту темі; меті, висновки чітко сформульовано; при захисті отримано точні відповіді на запитання; обсяг відповідно до вимог; оформлення відповідно вимог та стандарту', 'Повна відповідність змісту темі; меті, висновки чітко сформульовано; при захисті допущено несуттєві помилки; обсяг відповідно до вимог; оформлення відповідно вимог та стандарту', 'Повна відповідність змісту темі; меті, висновки чітко сформульовано; при захисті допущено незначні помилки у відповідях; обсяг відповідно до вимог; оформлення відповідно вимог та стандарту', 'В основному зміст відповідає темі; мету, висновки сформульовано розпливчасто; при захисті допущено помилки; обсяг відповідно до вимог; оформлення відповідно вимог та стандарту; рекомендація до опублікування після виправлення помилок', 'Зміст відповідає темі частково; мету, висновки не сформульовано; при захисті допущено помилки, які свідчать про недостатні знання теорії та практики; невідповідне оформлення та обсяг', NULL, NULL, 'Курсова робота не виконана. Представлено фрагментарне виконання завдань або не виконано повністю', NULL),
(6, NULL, NULL, 2, NULL, 'Повна відповідність змісту темі; меті, висновки чітко сформульовано; при захисті отримано точні відповіді на запитання; обсяг відповідно до вимог; оформлення відповідно вимог та стандарту', 'Повна відповідність змісту темі; меті, висновки чітко сформульовано; при захисті допущено несуттєві помилки; обсяг відповідно до вимог; оформлення відповідно вимог та стандарту', 'Повна відповідність змісту темі; меті, висновки чітко сформульовано; при захисті допущено незначні помилки у відповідях; обсяг відповідно до вимог; оформлення відповідно вимог та стандарту', 'В основному зміст відповідає темі; мету, висновки сформульовано розпливчасто; при захисті допущено помилки; обсяг відповідно до вимог; оформлення відповідно вимог та стандарту; рекомендація до опублікування після виправлення помилок', 'Зміст відповідає темі частково; мету, висновки не сформульовано; при захисті допущено помилки, які свідчать про недостатні знання теорії та практики; невідповідне оформлення та обсяг', NULL, NULL, 'Курсовий проєкт не виконана. Представлено фрагментарне виконання завдань або не виконано повністю', NULL),
(7, NULL, NULL, 3, NULL, 'Всі 6 пунктів РГР виконані у повному обсязі, з необхідними розрахунками та обгрунтуваннями, ескіз схеми закріплення виконано правильно', 'Всі 6 пунктів РГР виконані у повному обсязі, наявні незначні помилки у розрахунках та обгрунтуваннях, ескіз схеми закріплення виконано в основному правильно', 'Всі 6 пунктів РГР виконані у повному обсязі, наявні незначні та змістовні помилки у розрахунках та обгрунтуваннях, ескіз схеми закріплення виконано з помилками', 'Виконано 4-5 пунктів РГР з помилки у розрахунках та обгрунтуваннях, ескіз схеми закріплення не виконано', 'Виконано 1-3 пункти РГР з помилки у розрахунках та обгрунтуваннях, ескіз схеми закріплення не виконано', NULL, NULL, 'Робота відсутня', NULL),
(8, NULL, NULL, 4, NULL, 'Всі 6 пунктів РГЗ виконані у повному обсязі, з необхідними розрахунками та обгрунтуваннями, ескіз схеми закріплення виконано правильно', 'Всі 6 пунктів РГЗ виконані у повному обсязі, наявні незначні помилки у розрахунках та обгрунтуваннях, ескіз схеми закріплення виконано в основному правильно', 'Всі 6 пунктів РГЗ виконані у повному обсязі, наявні незначні та змістовні помилки у розрахунках та обгрунтуваннях, ескіз схеми закріплення виконано з помилками', 'Виконано 4-5 пунктів РГЗ з помилки у розрахунках та обгрунтуваннях, ескіз схеми закріплення не виконано', 'Виконано 1-3 пункти РГЗ з помилки у розрахунках та обгрунтуваннях, ескіз схеми закріплення не виконано', NULL, NULL, 'Завдання відсутнє', NULL),
(9, NULL, NULL, 5, NULL, 'У відповіді повністю розкрито суть питання, надано правильне теоретичне тлумачення та визначення, наведені приклади та необхідні ілюстрації', 'У відповіді розкрито суть питання, але допущені деякі несуттєві помилки, відсутні обґрунтування окремих положень, присутні помилки у наведених прикладах, присутні незначні помилки у необхідних ілюстраціях', 'У відповіді розкрито суть питання, але допущені неправильні обґрунтування окремих положень, прикладі не наведені, необхідні ілюстрації частково стосуються суті питання', 'У відповіді не розкрито суті питання, але наведені відомості, які стосуються суті питання, приклади не наведені, необхідні ілюстрації відсутні', 'У відповіді не розкрито суті питання, наведені відомості, які не стосуються суті питання, а лише спільної із питанням тематики, приклади не наведені, необхідні ілюстрації відсутні', NULL, NULL, 'Відповідь відсутня', NULL),
(10, NULL, NULL, 6, NULL, 'Правильне та безпомилкове проведення необхідних розрахунків з вірно виконаними ілюстраціями отриманих результатів', 'Правильне і безпомилкове розв\'язанні завдання, але без пояснень до розрахунків, з несуттєвими помилками у ілюстраціях до отриманих результатів', 'Правильне розв\'язання завдання, з деякими незначними помилками, без пояснень до розрахунків, з помилками в ілюстраціях до отриманих результатів', 'Завдання виконані з помилками, які свідчать про недостатні теоретичні знання, ілюстрації відсутні', 'Завдання не виконані, а лише наведено фрагменти тексту чи розрахунків, пов’язаних із темою завдання, ілюстрації відсутні', NULL, NULL, 'Завдання не виконані, ілюстрації відсутні', NULL),
(11, NULL, NULL, NULL, NULL, 'Повна відповідність змісту темі; мету, висновки чітко сформульовано; при захисті отримано точні відповіді на запитання; обсяг відповідно до вимог; оформлення відповідно вимог та стандарту.', 'Повна відповідність змісту темі; мету, висновки чітко сформульовано; при захисті допущено несуттєві помилки; обсяг відповідно до вимог; оформлення відповідно вимог та стандарту', 'Повна відповідність змісту темі; мету, висновки чітко сформульовано; при захисті допущено незначні помилки у відповідях; обсяг відповідно до вимог; оформлення відповідно вимог та стандарту', 'В основному зміст відповідає темі; мету, висновки сформульовано розпливчасто; при захисті допущено помилки; обсяг до вимог;\r\nоформлення відповідно вимог та стандарту; рекомендація до опублікування після виправлення помилок', 'Зміст відповідає темі частково; мету, висновки не сформульовано; при захисті допущено помилки, які свідчать про знання теорії та практики; невідповідне оформлення та обсяг', NULL, NULL, 'Представлено фрагментарне виконання додаткового завдання або не виконано повністю.\r\n', 1);

--
-- Індекси збережених таблиць
--

--
-- Індекси таблиці `assessmentCriterias`
--
ALTER TABLE `assessmentCriterias`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_assessmentCriteriasToWP` (`educationalDisciplineWPId`),
  ADD KEY `fk_assessmentCriteriasToLessonType` (`lessonTypeId`),
  ADD KEY `fk_assessmentCriteriasToTaskType` (`taskTypeId`);

--
-- AUTO_INCREMENT для збережених таблиць
--

--
-- AUTO_INCREMENT для таблиці `assessmentCriterias`
--
ALTER TABLE `assessmentCriterias`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=45;

--
-- Обмеження зовнішнього ключа збережених таблиць
--

--
-- Обмеження зовнішнього ключа таблиці `assessmentCriterias`
--
ALTER TABLE `assessmentCriterias`
  ADD CONSTRAINT `fk_assessmentCriteriasToLessonType` FOREIGN KEY (`lessonTypeId`) REFERENCES `lessonTypes` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk_assessmentCriteriasToTaskType` FOREIGN KEY (`taskTypeId`) REFERENCES `taskTypes` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk_assessmentCriteriasToWP` FOREIGN KEY (`educationalDisciplineWPId`) REFERENCES `educationalDisciplineWorkingProgram` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
