-- phpMyAdmin SQL Dump
-- version 5.2.1deb3
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:3306
-- Час створення: Січ 21 2025 р., 20:55
-- Версія сервера: 8.0.39-0ubuntu0.24.04.2
-- Версія PHP: 8.3.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База даних: `VNTU`
--

-- --------------------------------------------------------

--
-- Структура таблиці `departments`
--

CREATE TABLE `departments` (
  `id` int NOT NULL,
  `d_prev` int NOT NULL DEFAULT '0',
  `d_name` varchar(300) CHARACTER SET utf8mb3 COLLATE utf8mb3_unicode_ci NOT NULL,
  `d_type` int NOT NULL DEFAULT '0',
  `f_code` varchar(10) NOT NULL,
  `d_short` varchar(50) CHARACTER SET utf8mb3 COLLATE utf8mb3_unicode_ci NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3;

--
-- Дамп даних таблиці `departments`
--

INSERT INTO `departments` (`id`, `d_prev`, `d_name`, `d_type`, `f_code`, `d_short`) VALUES
(0, -1, 'Вінницький національний технічний університет', 8, '', 'ВНТУ'),
(205, 0, 'Факультет електроенергетики та електромеханіки', 2, '03', 'ФЕЕЕМ'),
(206, 0, 'Факультет інтелектуальних інформаційних технологій та автоматизації', 2, '01', 'ФІІТА'),
(367, 0, 'Імідж-центр', 4, '', ''),
(366, 350, 'Імідж-центр', 10, '', ''),
(368, 0, 'Відділ по забезпеченню зв`язків з кафедрами, органами студентського самоврядування, профкомом та зовнішніми організаціями', 10, '', ''),
(207, 0, 'Інститут екологічної безпеки та моніторингу довкілля', 10, '08', 'ІЕБМД'),
(208, 0, 'Факультет менеджменту та інформаційної безпеки', 2, '07', 'ФМІБ'),
(209, 0, 'Факультет машинобудування та транспорту', 2, '05', 'ФМТ'),
(210, 0, 'Факультет інформаційних технологій та комп`ютерної інженерії', 2, '04', 'ФІТКІ'),
(211, 0, 'Факультет Інформаційних електронних систем', 2, '06', 'ФІЕС'),
(212, 0, 'Факультет будівництва, цивільної та екологічної інженерії', 2, '02', 'ФБЦЕІ'),
(213, 205, 'Кафедра Філософії та гуманітарних наук', 3, '', ''),
(214, 206, 'Кафедра Інтеграції навчання з виробництвом', 10, '', ''),
(215, 209, 'Кафедра Фізичного виховання', 3, '', ''),
(216, 208, 'Кафедра Менеджменту, маркетингу та економіки', 3, '', ''),
(217, 208, 'Кафедра Фінансів та інноваційного менеджменту', 3, '', ''),
(218, 208, 'Кафедра Економіки підприємства і виробничого менеджменту', 3, '', ''),
(219, 205, 'Кафедра Електричних станцій та систем', 3, '', ''),
(220, 205, 'Кафедра Комп`ютеризовані електромеханічні системи і комплекси', 3, '', 'КЕМСК'),
(221, 205, 'Кафедра Теоретичної електротехніки та електричних вимірювань', 10, '', ''),
(222, 205, 'Кафедра Електротехнічних систем електроспоживання та енергетичного менеджменту', 3, '', ''),
(223, 211, 'Кафедра Суспільно-політичних наук', 3, '', ''),
(224, 209, 'Кафедра Технологій та автоматизації машинобудування', 3, '', ''),
(225, 209, 'Кафедра Галузевого машинобудування', 3, '', ''),
(226, 209, 'Кафедра Автомобілів та транспортного менеджменту', 3, '', ''),
(227, 209, 'Кафедра Технології підвищення зносостійкості', 0, '', ''),
(228, 209, 'Кафедра Опору матеріалів, теоретичної механіки та інженерної графіки', 3, '', ''),
(229, 206, 'Кафедра Комп`ютерних систем управління', 3, '', ''),
(230, 206, 'Кафедра Автоматизації та інтелектуальних інформаційних технологій', 3, '', ''),
(231, 211, 'Кафедра Метрології та промислової автоматики', 0, '', ''),
(355, 0, 'Навчально-науковий Інститут Конфуція ВНТУ', 4, '', ''),
(232, 206, 'Кафедра Лазерної та оптикоелектронної техніки', 10, '', ''),
(233, 210, 'Кафедра Обчислювальної техніки', 3, '', ''),
(234, 206, 'Кафедра Комп`ютерних наук', 3, '', ''),
(235, 210, 'Кафедра Вищої математики', 3, '', ''),
(236, 211, 'Кафедра Інформаційних радіоелектронних технологій і систем', 3, '', ''),
(237, 211, 'Кафедра Електроніки та наносистем', 0, '', ''),
(238, 211, 'Кафедра Біомедичної інженерії та оптико-електронних систем', 3, '', ''),
(239, 205, 'Кафедра Загальної фізики', 3, '', ''),
(240, 212, 'Кафедра Промислового та цивільного будівництва', 10, '', ''),
(241, 212, 'Кафедра Теплоенергетики', 3, '', ''),
(242, 212, 'Кафедра Менеджменту будівництва та цивільної оборони', 10, '', ''),
(243, 212, 'Кафедра Іноземних мов', 3, '', ''),
(244, 212, 'Кафедра Будівництва, міського господарства та архітектури', 3, '', ''),
(245, 212, 'Кафедра Інженерних систем у будівництві', 3, '', ''),
(246, 210, 'Кафедра Захисту інформації', 3, '', ''),
(247, 210, 'Кафедра Програмного забезпечення', 3, '', ''),
(248, 211, 'Кафедра Інфокомунікаційних систем і технологій', 3, '', ''),
(249, 211, 'Кафедра Проектування комп`ютерної та телекомунікаційної апаратури', 10, '', ''),
(250, 208, 'Кафедра Менеджменту та безпеки інформаційних систем', 3, '', ''),
(251, 211, 'Кафедра Мовознавства', 3, '', ''),
(252, 206, 'Кафедра Системного аналізу та інформаційних технологій', 3, '', ''),
(253, 208, 'Кафедра Підприємництва та фінансової діяльності', 0, '', ''),
(254, 212, 'Кафедра Екології, хімії та технологій захисту довкілля', 3, '', ''),
(255, 205, 'Кафедра Відновлювальної енергетики та транспортних електричних систем і комплексів', 0, '', ''),
(256, 207, 'Кафедра Хімії та хімічної технології', 10, '', ''),
(257, 210, 'Кафедра Безпеки життєдіяльності та педагогіки безпеки', 3, '', 'БЖД ПБ'),
(259, 0, 'Навчально-методичний відділ', 10, '', ''),
(260, 0, 'Центр довузівської підготовки', 10, '', ''),
(261, 260, 'Підготовче відділення для громадян України', 0, '', ''),
(262, 350, 'Центр міжнародних зв`язків', 0, '', ''),
(263, 262, 'Підготовче відділення для іноземних громадян', 0, '', ''),
(266, 0, 'Керівний склад', 4, '', ''),
(267, 0, 'Інститут докторантури та аспірантури', 2, '', 'ІДА'),
(268, 0, 'Інший підрозділ', 8, '', ''),
(269, 0, 'Центр електронних комунікацій \"InterCEC\"', 4, '', ''),
(270, 356, 'Організаційний відділ', 4, '', ''),
(271, 356, 'Інформаційно-аналітичний центр', 4, '', ''),
(272, 0, 'Електровимірювальна лабораторія', 4, '', ''),
(273, 0, 'Редакційно-видавничий відділ', 4, '', ''),
(274, 0, 'Культурно-мистецький і просвітницький центр', 4, '', ''),
(275, 0, 'ЦПО Ін ІНВ (центр післядипломної освіти)', 10, '', ''),
(276, 0, 'Ректорат', 4, '', ''),
(277, 0, 'Юридичний відділ', 4, '', ''),
(278, 0, 'ВП та МТЗ (Відділ постачання та матеріально-технічного забезпечення)', 4, '', ''),
(279, 267, 'Відділ аспірантури та докторантури', 9, '', ''),
(280, 0, 'Штаб цивільного захисту', 4, '', ''),
(281, 0, 'Планово-фінансовий відділ', 4, '', ''),
(282, 0, 'Бухгалтерія', 4, '', ''),
(283, 0, 'Відділ кадрів', 4, '', ''),
(284, 0, 'Господарсько-експлуатаційний відділ', 4, '', ''),
(285, 0, 'Студмістечко', 10, '', ''),
(286, 0, 'Канцелярія', 10, '', ''),
(287, 0, 'Відділ охорони праці', 4, '', ''),
(288, 0, 'Військово-мобілізаційний підрозділ', 4, '', ''),
(289, 0, 'Архів', 10, '', ''),
(290, 0, 'Науково-технічна бібліотека', 4, '', ''),
(291, 290, '(ВІТКЗ НТБ) Відділ інформаційних технологій та компютерного забезпечення науково-технічної бібліотеки', 0, '', ''),
(292, 0, 'Редакційно-видавничий відділ', 10, '', ''),
(293, 284, 'Головний навчальний корпус', 4, '', ''),
(294, 284, 'Навчальний корпус №1', 4, '', ''),
(295, 284, 'Навчальний корпус №2', 4, '', ''),
(296, 284, 'Навчальний корпус №3', 4, '', ''),
(297, 284, 'Навчальний корпус №4', 4, '', ''),
(298, 284, 'Навчальний корпус №5', 4, '', ''),
(299, 284, 'Навчальний корпус №6', 4, '', ''),
(300, 284, 'Гуртожиток №1', 4, '', ''),
(301, 284, 'Гуртожиток №2', 4, '', ''),
(302, 284, 'Гуртожиток №3', 4, '', ''),
(303, 284, 'Гуртожиток №4', 4, '', ''),
(304, 284, 'Гуртожиток №5', 4, '', ''),
(305, 284, 'Гуртожиток №6', 4, '', ''),
(306, 0, 'Спортивно-оздоровчий табір \"Супутник\"', 4, '', ''),
(307, 0, 'Відділ головного енергетика', 4, '', ''),
(308, 0, 'Відділ головного механіка', 4, '', ''),
(309, 0, 'Господарський двір', 10, '', ''),
(310, 332, 'Клуб', 4, '', ''),
(311, 0, 'ЦДП (центр довузівської підготовки)', 10, '', ''),
(312, 0, 'Їдальня', 4, '', ''),
(313, 284, 'Навчальний корпус №8', 4, '', ''),
(314, 284, 'Навчальний корпус №7', 4, '', ''),
(315, 316, 'Навчально-виробнича дільниця', 0, '', ''),
(316, 0, 'Ремонтно-експлуатаційний відділ', 4, '', ''),
(317, 0, 'Центр дистанційної освіти', 4, '', ''),
(318, 0, 'Лабораторія по спеціальності', 10, '', ''),
(341, 0, 'Навчальний відділ', 4, '', ''),
(320, 0, 'Центр комп`ютерних технологій', 10, '', ''),
(321, 316, 'Ремонтно-будівельна дільниця', 0, '', ''),
(322, 373, 'Психологічна служба', 10, '', ''),
(369, 0, 'Центр соціологічних досліджень', 10, '', ''),
(323, 0, 'ФІТКІ (інформаційних технологій та компютерної інженерії)', 10, '', ''),
(324, 0, 'НМД', 4, '', ''),
(325, 0, 'Технічна редакція журналу Наукові праці ВНТУ', 10, '', ''),
(326, 0, 'Центр міжнародних зв`язків та проектів', 4, '', ''),
(327, 267, 'Відділ магістратури', 0, '', ''),
(329, 0, 'ПФД (Підприємства і фінансової діяльності)', 4, '', ''),
(330, 0, 'Лабораторія соціологічних досліджень', 10, '', ''),
(331, 0, 'Інформаційно-аналітичний центр автоматизованого керування навчальним процесом (ІАЦАКНП)', 10, '', ''),
(332, 0, 'Центр соціально-організаційної роботи', 4, '', ''),
(333, 363, 'Студентське проектно-конструкторське бюро', 4, '', ''),
(334, 0, 'ЦІТЗІ(центр інформаційних технологій і захисту інформації)', 4, '', ''),
(335, 0, 'ННЦАВЧПКТ Навчально-науковий центр автоматизації в-ва та ЧПК технологій', 10, '', ''),
(336, 0, 'Центр технічного перекладу', 10, '', ''),
(337, 0, 'НВЦУРМБУ(навчально-виробничий центр утримання та розвитку матеріальної бази університету)', 10, '', ''),
(338, 0, 'Режимно-секретний підрозділ', 4, '', ''),
(339, 0, 'Сектор публічних закупівель бухгалтерії', 10, '', ''),
(340, 0, 'Центр забезпечення якості освіти ВНТУ', 4, '', ''),
(350, 0, '-', 10, '', ''),
(342, 267, 'Спеціалізовані вчені Ради', 9, '', ''),
(343, 268, 'НДЛ Екологічних досліджень та екологічного моніторингу', 4, '', ''),
(344, 268, 'НДЛ \"Ефективні будівельні конструкції\"', 4, '', ''),
(345, 268, 'науково-дослідна частина', 4, '', ''),
(346, 345, 'Науково-організаційний відділ', 1, '', ''),
(347, 0, 'Кафедра Військової підготовки', 2, '', ''),
(348, 0, 'Лабораторний центр BioArt', 4, '', ''),
(349, 208, 'Кафедра Підприємництва, логістики та менеджменту', 3, '', ''),
(351, 0, 'Відділ публічних закупівель', 10, '', ''),
(352, 0, 'Медіацентр', 10, '', ''),
(353, 0, 'Медіацентр', 10, '', ''),
(354, 270, 'Інститут навчання з виробництвом', 9, '', ''),
(356, 0, 'Інститут інтеграції навчання з виробництвом', 10, '', ''),
(357, 350, 'перший проректор з наукової роботи та міжнародного співробітництва', 10, '', ''),
(1, 0, 'JetIQ', 100, '', ''),
(358, 326, 'Відділ по роботі з іноземними студентами та слухачами ЦМЗП', 4, '', ''),
(359, 326, 'Відділ з розробки міжнародних проектів і програм ЦМЗП', 4, '', ''),
(360, 326, 'Відділ з набору іноземних громадян та паспортно-візової роботи ЦМЗП', 4, '', ''),
(361, 326, 'Підготовче відділення для іноземних громадян ЦМЗП', 0, '', ''),
(363, 0, 'Центр розвитку інфраструктури та енергоменеджменту', 4, '', ''),
(364, 363, 'Технічний відділ', 0, '', ''),
(365, 363, 'Відділ енергоменеджменту', 0, '', ''),
(370, 0, 'Головний центр організаційного та методичного забезпечення навчання (ГЦ ОМЗН)', 10, '', ''),
(373, 0, 'Відділ соціально-організаційної роботи.', 10, '', ''),
(378, 340, 'Сектор соціологічних досліджень', 0, '', ''),
(379, 340, 'Сектор розвитку персоналу та практик академічної доброчесності', 0, '', ''),
(380, 281, 'Сектор публічних закупівель', 4, '', ''),
(381, 0, 'Загальний відділ \"Офіс ректора\"', 4, '', ''),
(382, 0, 'Центр розвитку кар`єри та неперервної освіти', 4, '', ''),
(383, 0, 'Центр діджиталізації освітнього процесу', 4, '', ''),
(384, 0, 'Допоміжний підрозділ', 10, '', ''),
(385, 0, 'Відділ організаційно-методичного забезпечення ЄДЕБО', 4, '', ''),
(386, 290, 'Патентно-інформаційний сектор НТБ', 4, '', ''),
(387, 290, 'Патентно-інформаційний сектор НТБ', 0, '', '');

--
-- Індекси збережених таблиць
--

--
-- Індекси таблиці `departments`
--
ALTER TABLE `departments`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для збережених таблиць
--

--
-- AUTO_INCREMENT для таблиці `departments`
--
ALTER TABLE `departments`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=388;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
