-- phpMyAdmin SQL Dump
-- version 5.2.1deb3
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:3306
-- Час створення: Січ 21 2025 р., 20:56
-- Версія сервера: 8.0.39-0ubuntu0.24.04.2
-- Версія PHP: 8.3.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База даних: `VNTU`
--

-- --------------------------------------------------------

--
-- Структура таблиці `special`
--

CREATE TABLE `special` (
  `id` int NOT NULL,
  `f_code` int NOT NULL,
  `spec_code` varchar(50) NOT NULL DEFAULT '',
  `spec` varchar(200) NOT NULL DEFAULT '',
  `spec_num_code` varchar(100) CHARACTER SET utf8mb3 COLLATE utf8mb3_unicode_ci NOT NULL,
  `arc` tinyint NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb3;

--
-- Дамп даних таблиці `special`
--

INSERT INTO `special` (`id`, `f_code`, `spec_code`, `spec`, `spec_num_code`, `arc`) VALUES
(1, 210, 'ПЗС', 'Програмне забезпечення систем', '8.05010301', 1),
(4590, 206, 'О', 'Напрям. Оптотехніка', '6.051004', 1),
(4589, 206, 'СІ', 'Системна інженерія.', '6.050201', 1),
(4591, 206, 'МІТ', 'Напрям. Метрологія та інформаційно-вимірювальні технології', '6.051001', 1),
(4592, 206, 'МСС', 'Напрям. Метрологія, стандартизація та сертифікація', '6.051002', 1),
(4593, 206, 'І', 'Напрям. Інформатика', '6.040302', 1),
(4594, 206, 'АВ', 'Напрям. Автоматизація та комп`ютерно-інтегровані технології', '6.050202', 1),
(4595, 206, 'КСУАм', 'Комп`ютеризовані системи управління та автоматика', '8.05020101', 1),
(4597, 211, 'ЛОТм', 'Метрологія та інформаційно-вимірювальна техніка. Лазерна і оптоелектронна техніка.', '152', 0),
(4598, 210, 'ПІ', 'Програмна інженерія', '6.', 1),
(4705, 267, 'ПО', 'Професійна освіта (за спеціалізаціями). Професійна освіта.\n', '015', 0),
(4784, 210, '', 'Електронно-обчислювальні машини.', '0608', 1),
(4782, 205, 'ЕЕ', 'Електроенергетика, електротехніка та електромеханіка. Електропостачання та енергозбереження.', '141', 0),
(4610, 211, 'ІЯП', 'Метрологія та інформаційно-вимірювальна техніка. Інженерія якості продукції.', '152', 0),
(4611, 211, 'ІВТ', 'Комп`ютеризовані інформаційно-вимірювальні технології', '152', 0),
(4612, 211, 'ЛТО', 'Метрологія та інформаційно-вимірювальна техніка. Лазерна техніка та оптоінформатика.', '152', 0),
(4613, 206, 'ІКТ', 'Комп`ютерні науки та інформаційні технології. Інформаційно-комунікаційні технології.', '122', 0),
(4614, 206, 'КЕЕМ', 'Комп\'ютерні науки та інформаційні технології. Комп’ютерний еколого-економічний моніторинг', '122', 0),
(4615, 206, 'СА', 'Системний аналіз. Системний аналіз.', '124', 0),
(4619, 206, 'МВТ', 'Метрологія та вимірювальна техніка', '7.05100101', 1),
(4621, 206, 'АКІТ', 'Автоматизація та комп\'ютерно-інтегровані технології. Комп\'ютеризовані системи управління та автоматика.', '151', 0),
(4622, 211, 'КІВТа', 'Метрологія та інформаційно-вимірювальна техніка. Комп`ютеризовані інформаційно-вимірювальні технології.', '152', 0),
(4623, 206, 'КНІТ', 'Комп\'ютерні науки та інформаційні технології', '122', 0),
(4625, 205, 'Е', 'Електротехніка та електротехнології.', '6.050701', 1),
(4626, 205, 'ЕМ', 'Електромеханіка.', '6.050702', 1),
(4783, 205, 'ЕМСА', 'Електроенергетика, електротехніка та електромеханіка. Електромеханічні системи автоматизації.', '141', 0),
(4630, 205, 'ЕМ', 'Електроенергетика, електротехніка та електромеханіка. Енергетичний менеджмент.', '141', 0),
(4777, 267, 'МАКІТ', 'Автоматизація та комп\'ютерно-інтегровані технології. Методологія автоматизації та комп\'ютерно-інтегрованих технологій.', '151', 0),
(4633, 206, 'АКІТ', 'Автоматизація та комп`ютерно-інтегровані технології. Системна інженерія.', '151', 0),
(4634, 206, 'КІВ', 'Автоматизація та комп\'ютерно-інтегровані технології Комп\'ютерно-інтегровані виробництва і бізнес-процеси', '151', 0),
(4770, 211, '', 'Радіоелектронні апарати.', '6.050902', 1),
(4780, 267, 'МЗа', 'Матеріалознавство. Матеріалознавство.', '132', 0),
(4637, 206, 'ІСТ', 'Інформаційні системи та технології. Інтелектуальні інформаційні системи.', '126', 0),
(4638, 206, 'ІСТ', 'Інформаційні системи та технології. Прикладні інформаційні технології.', '126', 0),
(4778, 211, 'ТКРП', 'Телекомунікації та радіотехніка. Програмне забезпечення телекомунікаційних систем.', '172', 0),
(4765, 211, 'КІВТ', 'Метрологія та інформаційно-вимірювальна техніка.', '152', 0),
(4640, 206, 'АКІТ', 'Автоматизація та комп`ютерно-інтегровані технології. Інтелектуальні комп`ютерні системи.', '151', 0),
(4641, 206, 'АКІТ', 'Автоматизація та комп`ютерно-інтегровані технології. Інформаційні системи і Інтернет речей.', '151', 0),
(4643, 205, 'ЕСМ', 'Електроенергетика, електротехніка та електромеханіка. Електричні системи і мережі.', '141', 0),
(4644, 206, 'ІСТ', 'Iнформацiйнi системи та технології.', '126', 0),
(4645, 210, 'ПІ', 'Інженерія програмного забезпечення. Інженерія програмного забезпечення.', '121', 0),
(4646, 210, 'БКС', 'Кібербезпека. Кібербезпека критичних систем.', '125', 0),
(4648, 267, 'М', 'Магістранти', '2', 1),
(4649, 267, 'А', 'Аспіранти', '3', 1),
(4654, 208, 'М', 'Менеджмент. Логістика. ', '073', 0),
(4661, 209, 'ПМ', 'Прикладна механіка. Комп`ютеризовані технології та механотронні системи в машинобудуванні.', '131', 0),
(4662, 209, 'МЗ', 'Матеріалознавство. Інтелектуальні технологічні системи в інженерії поверхні.', '132', 0),
(4663, 209, 'ГМ', 'Галузеве машинобудування. Галузеве машинобудування.', '133', 0),
(4665, 212, 'ТЕ', 'Теплоенергетика. Теплоенергетика.', '144', 0),
(4775, 212, 'ЕССМБ', 'Будівництво та цивільна інженерія. Енергоефективні системи створення мікроклімату будівель.', '192', 0),
(4670, 212, 'ТЗНС', 'Технології захисту навколишнього середовища. Технології захисту навколишнього середовища.', '183', 0),
(4671, 212, 'Б', 'Будівництво та цивільна інженерія. Будівництво та цивільна інженерія.', '192', 0),
(4674, 205, 'ЕЕ', 'Електроенергетика, електротехніка та електромеханіка. Електроенергетика та електротехніка.', '141', 0),
(4679, 206, 'ІСТ', 'Інформаційні системи та технології. Інформаційні технології аналізу даних та зображень.', '126', 0),
(4676, 209, 'АТ', 'Автомобільний транспорт. Автомобільний транспорт.', '274', 0),
(4677, 209, 'ТТ', 'Транспортні технології. Транспортні технології на автомобільному транспорті.', '275', 0),
(4678, 209, 'СЗ', 'Озброєння та військова техніка', '255', 1),
(4680, 211, 'КОІС', 'Метрологія та інформаційно-вимірювальна техніка. Комп`ютеризовані оптико-інформаційні системи.', '152', 0),
(4681, 206, 'АКІТ', 'Автоматизація та комп`ютерно-інтегровані технології. Автоматизація та комп`ютерно-інтегровані технології.', '151', 0),
(4682, 206, 'АКІТ', 'Автоматизація та комп`ютерно-інтегровані технології. Інтелектуальні комп`ютерні системи управління.', '151', 0),
(4684, 211, 'БМІ', 'Біомедична інженерія. Біомедична інженерія.', '163', 0),
(0, 206, '-', '-', '-', 1),
(4774, 206, '', 'Оптотехніка.', '6.051004', 1),
(4690, 211, 'ЕЛ', 'Електроніка. Електроніка.', '171', 0),
(4688, 208, 'УБ', 'Кібербезпека. Управління інформаційною безпекою.', '125', 0),
(4689, 212, 'ЕКО', 'Екологія. Екологія.', '101', 0),
(4691, 211, 'МНТ', 'Мікро- та наносистемна техніка. Мікро- та наносистемна техніка.', '176', 0),
(4692, 207, 'ТКР', 'Телекомунікації та радіотехніка. Телекомунікації.', '172', 0),
(4693, 208, 'КІН', 'Системний аналіз. Консолідована інформація.', '124', 0),
(4773, 206, '', 'Системи управління і автоматики.', '6.091400', 1),
(4772, 211, '', 'Технології та засоби телекомунікацій.', '7.091004', 1),
(4702, 208, 'ЕК', 'Економіка. Економіка.', '051', 0),
(4704, 210, 'КІ', 'Комп`ютерна інженерія. Комп`ютерна інженерія.', '123', 0),
(4706, 267, 'П', 'Політологія.', '052', 0),
(4707, 210, 'БС', 'Кібербезпека. Безпека інформаційних і комунікаційних систем.', '125', 0),
(4776, 205, '', 'Електротехніка.', '0906', 1),
(4709, 206, 'КН', 'Комп`ютерні науки. Комп`ютерні науки.', '122', 0),
(4710, 206, 'КН', 'Комп`ютерні науки. Системи штучного інтелекту.', '122', 0),
(4711, 210, 'СП', 'Комп`ютерна інженерія. Системне програмування.', '123', 0),
(4712, 205, 'ЕМ', 'Електроенергетика, електротехніка та електромеханіка. Електромеханіка.', '141', 0),
(4713, 205, 'ЕС', 'Електроенергетика, електротехніка та електромеханіка. Електричні станції.', '141', 0),
(4714, 205, 'ЕСЕ', 'Електроенергетика, електротехніка та електромеханіка. Електротехнічні системи електроспоживання.', '141', 0),
(4715, 205, 'ЕТЗ', 'Електроенергетика, електротехніка та електромеханіка. Електричні системи і комплекси транспортних засобів.', '141', 0),
(4716, 205, 'ЕМ', 'Електроенергетика, електротехніка та електромеханіка. Електроенергетика, електротехніка та електромеханіка.', '141', 0),
(4717, 205, 'ЕПА', 'Електроенергетика, електротехніка та електромеханіка. Електромеханічні системи автоматизації та електропривод.', '141', 0),
(4718, 212, 'ЦБ', 'Будівництво та цивільна інженерія. Промислове та цивільне будівництво.', '192', 0),
(4719, 212, 'МБ', 'Будівництво та цивільна інженерія. Міське будівництво та господарство.', '192', 0),
(4720, 212, 'ТГ', 'Будівництво та цивільна інженерія. Теплогазопостачання і вентиляція.', '192', 0),
(4721, 211, 'ІТТ', 'Телекомунікації та радіотехніка. Інформаційно-телекомунікаційні технології.', '172', 0),
(4722, 211, 'АРЗ', 'Телекомунікації та радіотехніка. Апаратура радіозв`язку, радіомовлення і телебачення.', '172', 0),
(4723, 211, 'БМІ', 'Біомедична інженерія. Інтелектуальні штучні імпланти та медичні апарати в біоінженерії.', '163', 0),
(4724, 211, 'БМА', 'Біомедична інженерія. Біотехнічні та медичні апарати і системи.', '163', 0),
(4725, 211, 'ЕЛ', 'Електроніка. Електронні пристрої та системи.', '171', 0),
(4726, 211, 'РТ', 'Телекомунікації та радіотехніка. Радіотехніка.', '172', 0),
(4727, 211, 'ТКР', 'Телекомунікації та радіотехніка.', '172', 0),
(4749, 211, 'ТТК', 'Телекомунікації.', '6.050903', 1),
(4728, 211, 'ТКС', 'Телекомунікації та радіотехніка. Телекомунікаційні системи та мережі.', '172', 0),
(4763, 211, '0701', 'Радіотехніка.', '6.050901', 1),
(4730, 211, 'ТТК', 'Телекомунікації та радіотехніка. Технології та засоби телекомунікацій.', '172', 0),
(4731, 208, 'КІТС', 'Кібербезпека. Кібербезпека інформаційних технологій та систем.', '125', 0),
(4732, 208, 'МІТ', 'Менеджмент. Менеджмент інформаційних технологій.', '073', 0),
(4733, 208, 'МБА', 'Менеджмент. Менеджмент і бізнес-адміністрування.', '073', 0),
(4734, 208, 'МВКД', 'Менеджмент. Менеджмент виробничої та комерційної діяльності.', '073', 0),
(4735, 208, 'МЗД', 'Менеджмент. Менеджмент зовнішньоекономічної діяльності.', '073', 0),
(4736, 208, 'МПОУ', 'Менеджмент. Менеджмент підприємств, організацій і установ.', '073', 0),
(4737, 208, 'МР', 'Маркетинг. Маркетинг.', '075', 0),
(4738, 208, 'МФК', 'Менеджмент. Менеджмент фінансово-кредитної діяльності.', '073', 0),
(4739, 208, 'П', 'Підприємництво, торгівля та біржова діяльність. Підприємництво, торгівля та біржова діяльність.', '076', 0),
(4740, 208, 'МФК', 'Менеджмент. Менеджмент.', '073', 0),
(4741, 209, 'МЗ', 'Матеріалознавство. Ремонт та відновлення автомобілів і машин транспортної інфраструктури.', '132', 0),
(4742, 209, 'ПМ', 'Прикладна механіка. Комп`ютерні технології в машинобудівному виробництві.', '131', 0),
(4743, 209, 'ПМ', 'Прикладна механіка. Технології машинобудування.', '131', 0),
(4744, 212, 'ЕКО', 'Екологія. Екологічна безпека та моніторинг довкілля.', '101', 0),
(4745, 212, 'ТЗД', 'Технології захисту навколишнього середовища. Інженерна екологія та ресурсозберігаючі технології.', '183', 0),
(4748, 211, 'ЕЛ', 'Електронні пристрої та системи.', '6.050802', 1),
(4750, 208, 'МО', 'Менеджмент організацій.', '7.050201', 1),
(4751, 212, 'ПБ', 'Промислове і цивільне будівництво.', '7.092101', 1),
(4752, 212, 'Б', 'Будівництво', '6.060101', 1),
(4753, 212, 'ТГ', 'Теплогазопостачання і вентиляція.', '6.092108', 1),
(4754, 209, 'ІМ', 'Інженерна механіка.', '6.050502', 1),
(4755, 209, 'АТ', 'Автомобілі та автомобільне господарство.', '7.090258', 1),
(4761, 210, 'КНІТ', 'Комп`ютерні науки та інформаційні технології. Комп`ютерні науки.', '122', 0),
(4757, 210, 'ПІ', 'Програмна інженерія.', '6.050103', 1),
(4758, 207, 'ЕКО', 'Екологія, охорона навколишнього середовища та збалансоване природокористування.', '6.040106', 1),
(4785, 211, '', 'Апаратура радіозв`язку, радіомовлення і телебачення.', '6.090700(03)', 1),
(4786, 267, 'СА', 'Системний аналіз.', '124', 0),
(4788, 267, 'ТРа', 'Телекомунікації та радіотехніка. Телекомунікації та радіотехніка.', '172', 1),
(4791, 267, 'М', 'Менеджмент.', '073', 0),
(4793, 212, '', 'Будівництво та цивільна інженерія. Промислове і цивільне будівництво.', '192', 0),
(4795, 212, '', 'Будівництво та цивільна інженерія. Автомобільні дороги, вулиці та дорожньо-транспортні споруди.', '192', 0),
(4796, 211, '', 'Електроніка. Програмне забезпечення та електронні системи транспортних засобів.', '171', 0),
(4797, 211, '', 'Виробництво електронних засобів.', '7.091001', 1),
(4874, 212, '', 'Архітектура та містобудування. Архітектура та містобудування.', '191', 0),
(4804, 209, 'ПМ', 'Прикладна механіка. Механотронні системи в машинобудуванні', '131', 0),
(4803, 209, '', 'Технологія машинобудування, металорізальні верстати і інструмент. Технологія машинобудування, металорізальні верстати і інструмент.', '0501', 0),
(4805, 212, '', 'Технології захисту навколишнього середовища. Комп`ютеризовані екологічні технології', '183', 0),
(4806, 208, '', 'Кібербезпека та захист інформації. Кібербезпека інформаційних технологій та систем', '125', 0),
(4849, 212, '', 'Екологія. Комп`ютеризований екологічний моніторинг.', '101', 0),
(4808, 267, 'АКІТР', 'Автоматизація, комп’ютерно-інтегровані технології та робототехніка. Автоматизація, комп`ютерно-інтегровані технології та робототехніка.', '174', 0),
(4809, 267, 'ЕКР', 'Електронні комунікації та радіотехніка. Телекомунікації та радіотехніка.', '172', 0),
(4810, 267, '', 'Інформаційно-вимірювальні технології. Метрологія та інформаційно-вимірювальна техніка.', '175', 0),
(4811, 267, '', 'Прикладна механіка. Прикладна механіка.', '131', 0),
(4812, 208, '', 'Кібербезпека. Кібербезпека.', '125', 0),
(4813, 267, '', 'Кібербезпека та захист інформації. Кібербезпека.', '125', 0),
(4842, 212, '', 'Будівництво. Будівництво.', '6.060101', 1),
(4816, 209, '', 'Автомобілі та автомобільне господарство. Автомобілі та автомобільне господарство.', '7.07010601', 1),
(4817, 209, '', 'Транспортні технології. Транспортно-логістичні технології на автомобільному транспорті.', '275', 0),
(4818, 209, '', 'Інженерна механіка. Інженерна механіка.', '6.050502', 1),
(4819, 211, '', 'Інформаційно-вимірювальні технології. Комп`ютеризовані інформаційно-вимірювальні технології.', '175', 0),
(4820, 211, '', 'Інформаційно-вимірювальні технології. Комп`ютеризовані оптико-інформаційні системи.', '175', 0),
(4821, 211, '', 'Електронні комунікації та радіотехніка. Програмне забезпечення телекомунікаційних систем.', '172', 0),
(4822, 211, '', 'Електронні комунікації та радіотехніка. Радіотехніка.', '172', 0),
(4823, 208, '', 'Кібербезпека та захист інформації. Кібербезпека інформаційних технологій та систем.', '125', 0),
(4824, 210, 'БС', 'Кібербезпека та захист інформації. Безпека інформаційних і комунікаційних систем.', '125', 0),
(4826, 211, '', ' Електронні комунікації та радіотехніка. Телекомунікаційні системи та мережі .', '172', 0),
(4827, 206, '', 'Автоматизація, комп‘ютерно-інтегровані технології та робототехніка. Інтелектуальні комп’ютерні системи. ', '174', 0),
(4828, 206, '', 'Автоматизація, комп‘ютерно-інтегровані технології та робототехніка. Інформаційні системи і Інтернет речей. ', '174', 0),
(4829, 211, '', 'Інформаційно-вимірювальні технології. Лазерна техніка та оптоінформатика . ', '175', 0),
(4830, 208, '', 'Підприємництво та торгівля. Підприємництво та торгівля. ', '076', 0),
(4831, 212, '', 'Екологія. Комп’ютеризований екологічний моніторинг. ', '101', 0),
(4844, 205, '', 'Відновлювані джерела енергії та гідроенергетика. Відновлювані джерела енергії та гідроенергетика.', '145', 0),
(4843, 210, 'ПО', 'Професійна освіта. Професійна освіта (Цифрові технології).', '015', 0),
(4833, 206, '', 'Автоматизація, комп`ютерно-інтегровані технології та робототехніка. Інтелектуальні комп`ютерні системи управління.', '174', 0),
(4834, 206, 'ПКТ', 'Комп`ютерні науки. Програмування та комп`ютерні технології.', '122', 0),
(4835, 211, '', 'Інформаційно-вимірювальні технології. Лазерна техніка та оптоінформатика.', '175', 0),
(4836, 211, '', 'Електронні комунікації та радіотехніка. Телекомунікаційні системи та мережі.', '172', 0),
(4837, 208, '', 'Підприємництво та торгівля. Підприємництво, торгівля та біржова діяльність.', '076', 0),
(4838, 208, '', 'Кібербезпека та захист інформації. Управління інформаційною безпекою.', '125', 0),
(4840, 206, '', 'Автоматизація, комп`ютерно-інтегровані технології та робототехніка. Інтелектуальні комп`ютерні системи.', '174', 0),
(4841, 206, '', 'Автоматизація, комп`ютерно-інтегровані технології та робототехніка. Інформаційні системи і Інтернет речей.', '174', 0),
(4845, 212, '', 'Хімічні технології та інженерія. Ресурсозберігаючі хімічні технології.', '161', 0),
(4850, 384, 'КПКО', 'Комплекси приймання та оброблення інформації з космічних об`єктів', '574', 0),
(4847, 210, 'БКС', 'Кібербезпека та захист інформації. Кібербезпека критичних систем. ', '125', 0),
(4848, 206, '', 'Комп`ютерні науки та інформаційні технології. Системи штучного інтелекту.', '122', 0),
(4851, 211, '', 'Технології та засоби телекомунікацій. Телекомунікації.', '6.091004', 1),
(4852, 205, '', 'Електромеханіка. Електромеханіка.', '6.050702', 1),
(4853, 209, '', 'Технологія машинобудування. Технологія машинобудування.', ' 6.090200(02)', 0),
(4854, 205, '', 'Електротехніка та електротехнології. Електротехніка та електротехнології.', '6.050701', 1),
(4855, 206, '', 'Системна інженерія. Системна інженерія.', '6.050201', 1),
(4856, 205, '', 'Енергетика теплотехнології. Енергетика теплотехнології.', '1008', 0),
(4857, 211, '', 'Технології та засоби телекомунікацій. Технології та засоби телекомунікацій.', '7.091004', 1),
(4858, 205, '', 'Електромеханічні системи автоматизації та електропривод. Електромеханічні системи автоматизації та електропривод.', '6.092200(03)', 1),
(4859, 211, '', 'Апаратура радіозв`язку, радіомовлення і телебачення. Апаратура радіозв`язку, радіомовлення і телебачення.', '7.05090102', 1),
(4860, 205, '', 'Електричні станції. Електричні станції.', '7.05070101', 1),
(4861, 206, '', 'Комп`ютеризовані системи управління і автоматики. Комп`ютеризовані системи управління і автоматики.', '7.091402(01)', 1),
(4862, 205, '', 'Електричні системи і мережі. Електричні системи і мережі.', '7.05070102', 1),
(4863, 212, '', 'Архітектура та містобудування', '191', 0),
(4864, 212, '', 'Екологія, охорона навколишнього середовища та збалансоване природокористування. Екологія, охорона навколишнього середовища та збалансоване природокористування.', '6.040106', 1),
(4865, 212, '', 'Промислове і цивільне будівництво. Промислове і цивільне будівництво.', '7.092101', 1),
(4866, 210, '', 'Програмне забезпечення автоматизованих систем. Програмне забезпечення автоматизованих систем.', '7.080403', 1),
(4867, 212, '', 'Теплогазопостачання і вентиляція. Теплогазопостачання і вентиляція.', '6.092108', 1),
(4869, 210, '', 'Професійна освіта. Кібербезпека критичних систем.', '015', 0),
(4871, 210, '', 'Кібербезпека та захист інформації. Системне програмування.', '125', 0),
(4872, 210, '', 'Кібербезпека та захист інформації. Кібербезпека та захист інформації.', '125', 0),
(4875, 0, 'ВсіСпец', 'Всі спеціальності. Буфер приймальної комісії', 'ВСІ', 0),
(4873, 208, '', 'Менеджмент. Кібербезпека інформаційних технологій та систем.', '073', 0),
(4876, 267, '', 'Кібербезпека та захист інформації', '125', 0),
(4877, 267, '', 'Прикладна маханіка', '131', 0),
(4878, 267, '', 'Галузеве машинобудування', '133', 0),
(4879, 267, '', 'Транспортні технології (за видами)', '275', 0),
(4880, 267, '', 'Матеріалознавство', '132', 0),
(4881, 267, '', 'Професійна освіта', '015-24а', 0);

--
-- Індекси збережених таблиць
--

--
-- Індекси таблиці `special`
--
ALTER TABLE `special`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `spec` (`spec`);

--
-- AUTO_INCREMENT для збережених таблиць
--

--
-- AUTO_INCREMENT для таблиці `special`
--
ALTER TABLE `special`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4883;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
