-- phpMyAdmin SQL Dump
-- version 5.2.1deb3
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:3306
-- Час створення: Січ 21 2025 р., 20:54
-- Версія сервера: 8.0.39-0ubuntu0.24.04.2
-- Версія PHP: 8.3.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База даних: `VNTU`
--

-- --------------------------------------------------------

--
-- Структура таблиці `workingProgramGlobalData`
--

CREATE TABLE `workingProgramGlobalData` (
  `id` int NOT NULL,
  `universityName` text,
  `universityShortName` text,
  `academicRightsAndResponsibilities` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп даних таблиці `workingProgramGlobalData`
--

INSERT INTO `workingProgramGlobalData` (`id`, `universityName`, `universityShortName`, `academicRightsAndResponsibilities`) VALUES
(1, 'Вінницький національний технічний університет', 'ВНТУ', 'Здобувачі вищої освіти, які навчаються у ВНТУ, мають дотримуватися норм забезпечення честі, гідності, взаємної поваги і довіри, рівноправності та толерантності усіх учасників освітнього процесу шляхом дотримання принципів академічної доброчесності, викладених у «Положенні про академічну доброчесність у ВНТУ».\r\nЗ метою запобігання та виявлення плагіату у навчальних роботах, розвитку навичок коректної роботи із джерелами інформації та впровадження практики належного цитування, дотримання вимог наукової етики та поваги до інтелектуальних надбань та активізація самостійності й індивідуальності при створенні авторського твору і відповідальності за порушення загальноприйнятих правил цитування слід дотримуватись норм «Положення про запобігання академічному плагіату та порядок його виявлення у навчальних, наукових, кваліфікаційних та науково-методичних роботах у ВНТУ».\r\nЗ метою визнання результатів навчання здобутих під час неформальної та/або інформальної освіти, тобто такої, що здобувалася за освітніми програмами та не передбачала присудження визнаних державою освітніх кваліфікацій за рівнями освіти, але могла завершуватися присвоєнням професійних та/або присудженням часткових освітніх кваліфікацій при навчанні на території України чи за її межами, а також освіти, яка здійснювалася у порядку самоосвіти, здобувачі вищої освіти можуть скористатися відповідними процедурами, наведеними у «Положення про порядок визнання результатів навчання, здобутих шляхом неформальної та/або інформальної освіти у ВНТУ».\r\nЗдобувачі вищої освіти мають право оскаржити результати проміжних та підсумкових контрольних заходів, але на лише на підставі аргументованих пояснень, відповідно до «Порядку організації та проведення заліків, диференційованих заліків, екзаменів у ВНТУ», а також безпосередньо звернувшись до освітнього омбудсмена, згідно «Положення про освітнього омбудсмена з прав студентів ВНТУ».\r\nЗ метою вирішення конфліктних ситуацій, що можуть виникнути у здобувачів вищої освіти із іншими учасниками освітнього процесу та/або недопущення виникнення конфліктних ситуацій слід бути обізнаним у нормах «Кодексу етику ВНТУ». Здобувачі вищої освіти ВНТУ мають керуватися принципом «нульової толерантності» до будь-яких проявів корупції і повинні вживати всіх передбачених законодавством заходів щодо запобігання, виявлення та протидії корупції і пов’язаним з нею діям (практикам), відповідно до «Антикорупційної програми ВНТУ».\r\nНаведені документи оприлюднені на сайті ВНТУ: https://vntu.edu.ua/uk/public-info/zag.html.\r\n');

--
-- Індекси збережених таблиць
--

--
-- Індекси таблиці `workingProgramGlobalData`
--
ALTER TABLE `workingProgramGlobalData`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для збережених таблиць
--

--
-- AUTO_INCREMENT для таблиці `workingProgramGlobalData`
--
ALTER TABLE `workingProgramGlobalData`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=48;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
