-- phpMyAdmin SQL Dump
-- version 5.2.1deb3
-- https://www.phpmyadmin.net/
--
-- Хост: localhost:3306
-- Час створення: Січ 11 2025 р., 21:52
-- Версія сервера: 8.0.39-0ubuntu0.24.04.2
-- Версія PHP: 8.3.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База даних: `VNTU`
--

-- --------------------------------------------------------

--
-- Структура таблиці `workingProgramGlobalDataOverwrite`
--

CREATE TABLE `workingProgramGlobalDataOverwrite` (
  `id` int NOT NULL,
  `educationalDisciplineWorkingProgramId` int DEFAULT NULL,
  `universityName` text,
  `universityShortName` text,
  `generalAssessmentCriteriaForA` text,
  `generalAssessmentCriteriaForB` text,
  `generalAssessmentCriteriaForC` text,
  `generalAssessmentCriteriaForD` text,
  `generalAssessmentCriteriaForE` text,
  `generalAssessmentCriteriaForFX` text,
  `generalAssessmentCriteriaForF` text,
  `practicalAssessmentCriteriaForA` text,
  `practicalAssessmentCriteriaForB` text,
  `practicalAssessmentCriteriaForC` text,
  `practicalAssessmentCriteriaForD` text,
  `practicalAssessmentCriteriaForE` text,
  `practicalAssessmentCriteriaForFXAndF` text,
  `courseworkAssessmentCriteriaForA` text,
  `courseworkAssessmentCriteriaForB` text,
  `courseworkAssessmentCriteriaForC` text,
  `courseworkAssessmentCriteriaForD` text,
  `courseworkAssessmentCriteriaForE` text,
  `courseworkAssessmentCriteriaForFXAndF` text,
  `colloquiumAssessmentCriteriaForA` text,
  `colloquiumAssessmentCriteriaForB` text,
  `colloquiumAssessmentCriteriaForC` text,
  `colloquiumAssessmentCriteriaForD` text,
  `colloquiumAssessmentCriteriaForE` text,
  `colloquiumAssessmentCriteriaForFXAndF` text,
  `academicRightsAndResponsibilities` text,
  `labAssessmentCriteriaForA` text,
  `labAssessmentCriteriaForB` text,
  `labAssessmentCriteriaForC` text,
  `labAssessmentCriteriaForD` text,
  `labAssessmentCriteriaForE` text,
  `labAssessmentCriteriaForFXAndF` text,
  `seminarAssessmentCriteriaForA` text,
  `seminarAssessmentCriteriaForB` text,
  `seminarAssessmentCriteriaForC` text,
  `seminarAssessmentCriteriaForD` text,
  `seminarAssessmentCriteriaForE` text,
  `seminarAssessmentCriteriaForFXAndF` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп даних таблиці `workingProgramGlobalDataOverwrite`
--

INSERT INTO `workingProgramGlobalDataOverwrite` (`id`, `educationalDisciplineWorkingProgramId`, `universityName`, `universityShortName`, `generalAssessmentCriteriaForA`, `generalAssessmentCriteriaForB`, `generalAssessmentCriteriaForC`, `generalAssessmentCriteriaForD`, `generalAssessmentCriteriaForE`, `generalAssessmentCriteriaForFX`, `generalAssessmentCriteriaForF`, `practicalAssessmentCriteriaForA`, `practicalAssessmentCriteriaForB`, `practicalAssessmentCriteriaForC`, `practicalAssessmentCriteriaForD`, `practicalAssessmentCriteriaForE`, `practicalAssessmentCriteriaForFXAndF`, `courseworkAssessmentCriteriaForA`, `courseworkAssessmentCriteriaForB`, `courseworkAssessmentCriteriaForC`, `courseworkAssessmentCriteriaForD`, `courseworkAssessmentCriteriaForE`, `courseworkAssessmentCriteriaForFXAndF`, `colloquiumAssessmentCriteriaForA`, `colloquiumAssessmentCriteriaForB`, `colloquiumAssessmentCriteriaForC`, `colloquiumAssessmentCriteriaForD`, `colloquiumAssessmentCriteriaForE`, `colloquiumAssessmentCriteriaForFXAndF`, `academicRightsAndResponsibilities`, `labAssessmentCriteriaForA`, `labAssessmentCriteriaForB`, `labAssessmentCriteriaForC`, `labAssessmentCriteriaForD`, `labAssessmentCriteriaForE`, `labAssessmentCriteriaForFXAndF`, `seminarAssessmentCriteriaForA`, `seminarAssessmentCriteriaForB`, `seminarAssessmentCriteriaForC`, `seminarAssessmentCriteriaForD`, `seminarAssessmentCriteriaForE`, `seminarAssessmentCriteriaForFXAndF`) VALUES
(1, NULL, 'Вінницький національний технічний університет', 'ВНТУ', 'Програмні результати досягнуті повністю. Теоретичний зміст курсу освоєний цілком, без прогалин; виявлено глибокі знання та розуміння предметної області та розуміння професійної діяльності, сформовано необхідні практичні навички вирішувати професійні завдання з організації реструктуризації та санації інноваційного підприємництва і розв’язувати проблеми у кризових ситуаціях з урахуванням зовнішніх та внутрішніх впливів; усі передбачені програмою навчання навчальні завдання виконані, якість їхнього виконання оцінено числом балів, близьким до максимального', 'Програмні результати досягнуті повністю. Теоретичний зміст курсу освоєний цілком, без прогалин; сформовано  уміння викладати основні ідеї щодо з організації реструктуризації та санації інноваційного підприємництва. Необхідні практичні навички роботи з освоєним матеріалом в основному сформовані, усі передбачені програмою навчання навчальні завдання виконані, якість виконання більшості з них оцінено числом балів, близьким до максимального', 'Програмні результати досягнуті повністю. Теоретичний зміст курсу освоєний цілком, без прогалин. Вміння викладати базові ідеї щодо з організації реструктуризації та санації інноваційного підприємництва,  а також практичні навички роботи з освоєним матеріалом сформовані недостатньо; усі передбачені програмою навчання завдання виконані, якість виконання жодного з них не оцінено мінімальним числом балів, деякі види завдань виконані з помилками', 'Програмні результати досягнуті. Теоретичний зміст курсу освоєний частково, але прогалини не носять істотного характеру, виявлено знання та розуміння основних положень реструктуризації та санації; необхідні практичні навички роботи з освоєним матеріалом в основному сформовані, більшість передбачених програмою навчання навчальних завдань виконано, деякі з виконаних завдань  містять помилки', 'Програмні результати досягнуті. Теоретичний зміст курсу освоєний частково, деякі практичні навички роботи не сформовані, частина передбачених програмою навчання завдань не виконано або якість виконання оцінено числом балів, близьким до мінімального', 'Програмні результати не досягнуті. Теоретичний зміст курсу освоєний частково, необхідні практичні навички роботи не сформовані, більшість передбачених програм навчання навчальних завдань не виконано, або якість їхнього виконання оцінено числом балів, близьким до мінімального; при додатковій самостійній роботі над матеріалом курсу можливе підвищення якості виконання навчальних завдань (з можливістю повторного складання)', 'Програмні результати не досягнуті. Теоретичний зміст курсу не освоєно, необхідні практичні навички роботи не сформовані, усі виконані навчальні завдання містять грубі помилки, додаткова самостійна робота над матеріалом курсу не приведе до якого-небудь значущого підвищення якості виконання навчальних завдань (з обов’язковим повторним курсом)', 'Виставляється при правильному та безпомилковому проведенні необхідних розрахунків з поясненням і коментуванням отриманих результатів', 'При правильному і безпомилковому розв\'язанні завдання, але без пояснень до розрахунків, без посилань на певні формули чи методики, при відсутності або помилкових коментарях до отриманих результатів', 'При правильному розв\'язанні завдання, з деякими незначними помилками, без пояснень до розрахунків, без посилань на певні формули чи методики, при відсутності або помилкових коментарях до отриманих результатів', 'Виставляється, якщо при виконанні завдання допущені помилки, які свідчать про недостатнє знання теорії', 'Виставляється, якщо при виконанні завдання допущені помилки, які свідчать про недостатнє знання теорії, пояснення відсутні або фрагментарні', 'Виставляється у випадку, якщо завдання не виконане взагалі', 'Повна відповідність змісту темі; меті, висновки чітко сформульовано; при захисті отримано точні відповіді на запитання; обсяг відповідно до вимог; оформлення відповідно вимог та стандарту', 'Повна відповідність змісту темі; меті, висновки чітко сформульовано; при захисті допущено несуттєві помилки; обсяг відповідно до вимог; оформлення відповідно вимог та стандарту', 'Повна відповідність змісту темі; меті, висновки чітко сформульовано; при захисті допущено незначні помилки у відповідях; обсяг відповідно до вимог; оформлення відповідно вимог та стандарту', 'В основному зміст відповідає темі; мету, висновки сформульовано розпливчасто; при захисті допущено помилки; обсяг відповідно до вимог; оформлення відповідно вимог та стандарту; рекомендація до опублікування після виправлення помилок', 'Зміст відповідає темі частково; мету, висновки не сформульовано; при захисті допущено помилки, які свідчать про недостатні знання теорії та практики; невідповідне оформлення та обсяг', 'Курсова робота не виконана. Представлено фрагментарне виконання завдань або не виконано повністю', '90-100% правильних відповідей', '82-89% правильних відповідей', '75-81% правильних відповідей', '64-74% правильних відповідей', '60-63% правильних відповідей', '35-59% правильних відповідей', 'Здобувачі вищої освіти, які навчаються у ВНТУ, мають дотримуватися норм забезпечення честі, гідності, взаємної поваги і довіри, рівноправності та толерантності усіх учасників освітнього процесу шляхом дотримання принципів академічної доброчесності, викладених у «Положенні про академічну доброчесність у ВНТУ».\r\nЗ метою запобігання та виявлення плагіату у навчальних роботах, розвитку навичок коректної роботи із джерелами інформації та впровадження практики належного цитування, дотримання вимог наукової етики та поваги до інтелектуальних надбань та активізація самостійності й індивідуальності при створенні авторського твору і відповідальності за порушення загальноприйнятих правил цитування слід дотримуватись норм «Положення про запобігання академічному плагіату та порядок його виявлення у навчальних, наукових, кваліфікаційних та науково-методичних роботах у ВНТУ».\r\nЗ метою визнання результатів навчання здобутих під час неформальної та/або інформальної освіти, тобто такої, що здобувалася за освітніми програмами та не передбачала присудження визнаних державою освітніх кваліфікацій за рівнями освіти, але могла завершуватися присвоєнням професійних та/або присудженням часткових освітніх кваліфікацій при навчанні на території України чи за її межами, а також освіти, яка здійснювалася у порядку самоосвіти, здобувачі вищої освіти можуть скористатися відповідними процедурами, наведеними у «Положення про порядок визнання результатів навчання, здобутих шляхом неформальної та/або інформальної освіти у ВНТУ».\r\nЗдобувачі вищої освіти мають право оскаржити результати проміжних та підсумкових контрольних заходів, але на лише на підставі аргументованих пояснень, відповідно до «Порядку організації та проведення заліків, диференційованих заліків, екзаменів у ВНТУ», а також безпосередньо звернувшись до освітнього омбудсмена, згідно «Положення про освітнього омбудсмена з прав студентів ВНТУ».\r\nЗ метою вирішення конфліктних ситуацій, що можуть виникнути у здобувачів вищої освіти із іншими учасниками освітнього процесу та/або недопущення виникнення конфліктних ситуацій слід бути обізнаним у нормах «Кодексу етику ВНТУ». Здобувачі вищої освіти ВНТУ мають керуватися принципом «нульової толерантності» до будь-яких проявів корупції і повинні вживати всіх передбачених законодавством заходів щодо запобігання, виявлення та протидії корупції і пов’язаним з нею діям (практикам), відповідно до «Антикорупційної програми ВНТУ».\r\nНаведені документи оприлюднені на сайті ВНТУ: https://vntu.edu.ua/uk/public-info/zag.html.\r\n', 'Виставляється при правильному та безпомилковому виконанні поставлених завдань з поясненням і коментуванням отриманих результатів', 'Виставляється при правильному і безпомилковому виконанні завдання, але без пояснень до розрахунків, без посилань на певні формули чи методики, при відсутності або помилкових коментарях до отриманих результатів', 'Виставляється при правильному виконанні завдання, з деякими незначними помилками, без пояснень до розрахунків, без посилань на певні формули чи методики, при відсутності або помилкових коментарях до отриманих результатів', 'Виставляється, якщо при виконанні завдання допущені помилки, які свідчать про недостатнє знання теорії та практики виконання.', 'Виставляється, якщо при виконанні допущені помилки, які свідчать про недостатнє знання теорії та практики, пояснення відсутні або фрагментарні.', 'Виставляється у випадку, якщо завдання не виконане взагалі або виконана з великою кількістю помилок', 'Виставляється при правильному та безпомилковому проведенні необхідних розрахунків з поясненням і коментуванням отриманих результатів', 'Виставляється при правильному і безпомилковому розв\'язанні завдання, але без пояснень до розрахунків, без посилань на певні формули чи методики, при відсутності або помилкових коментарях до отриманих результатів', 'Виставляється  при правильному розв\'язанні завдання, з деякими незначними помилками, без пояснень до розрахунків, без посилань на певні формули чи методики, при відсутності або помилкових коментарях до отриманих результатів', 'Виставляється, якщо при виконанні завдання допущені помилки, які свідчать про недостатнє знання теорії', 'Виставляється, якщо при виконанні завдання допущені помилки, які свідчать про недостатнє знання теорії, пояснення відсутні або фрагментарні.', 'Виставляється у випадку, якщо завдання не виконане взагалі');

--
-- Індекси збережених таблиць
--

--
-- Індекси таблиці `workingProgramGlobalDataOverwrite`
--
ALTER TABLE `workingProgramGlobalDataOverwrite`
  ADD PRIMARY KEY (`id`),
  ADD KEY `FK_globalDataToWorkingProgram` (`educationalDisciplineWorkingProgramId`);

--
-- AUTO_INCREMENT для збережених таблиць
--

--
-- AUTO_INCREMENT для таблиці `workingProgramGlobalDataOverwrite`
--
ALTER TABLE `workingProgramGlobalDataOverwrite`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=48;

--
-- Обмеження зовнішнього ключа збережених таблиць
--

--
-- Обмеження зовнішнього ключа таблиці `workingProgramGlobalDataOverwrite`
--
ALTER TABLE `workingProgramGlobalDataOverwrite`
  ADD CONSTRAINT `FK_globalDataToWorkingProgram` FOREIGN KEY (`educationalDisciplineWorkingProgramId`) REFERENCES `educationalDisciplineWorkingProgram` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
